Base_1/src/Catalogs/ВычетыИПН/ВычетыИПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВычетыИПН</name>
  <predefined>
    <items>
      <name>ВычетВОСМС</name>
      <description>Вычет ВОСМС</description>
    </items>
    <items>
      <name>ВычетОПВ</name>
      <description>Вычет ОПВ</description>
    </items>
    <items>
      <name>ДобровольныеПенсионныеВзносы</name>
      <description>Добровольные пенсионные взносы</description>
    </items>
    <items>
      <name>ПогашениеВознагражденияПоЖилищнымЗаймам</name>
      <description>Расходы на оплату вознаграждений по ипотечным жилищным займам</description>
    </items>
    <items>
      <name>НаОплатуМедицинскихУслуг</name>
      <description>Расходы на оплату медицинских услуг</description>
    </items>
    <items>
      <name>Стандартный75МЗПИнвалиды</name>
      <description>Стандартный (инвалидам, участникам ВОВ)</description>
    </items>
    <items>
      <name>Стандартный75МЗПРодители</name>
      <description>Стандартный (родителям инвалидов, приемным родителям)</description>
    </items>
    <items>
      <name>Стандартный1МЗП</name>
      <description>Стандартный 14 МРП (1 МЗП)</description>
    </items>
    <items>
      <name>СтраховыеПремииПоДоговорамНакопительногоСтрахования</name>
      <description>Страховые премии, вносимые в свою пользу физическим лицом по договорам накопительного страхования</description>
    </items>
  </predefined>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредоставлениеВычета</name>
    <type>
      <types>EnumRef.ВидыПредоставленияВычетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзносов</name>
    <type>
      <types>CatalogRef.НалогиСборыОтчисления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПределВычета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодПредоставления</name>
    <type>
      <types>EnumRef.ПериодыРасчетаВычетовИКорректировокДоходов</types>
    </type>
  </attributes>
</mdclass:Catalog>

Base_1/src/Catalogs/НалогиСборыОтчисления/НалогиСборыОтчисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НалогиСборыОтчисления</name>
  <predefined>
    <items>
      <name>Акциз</name>
      <description>Акциз</description>
    </items>
    <items>
      <name>ВзносыОбязательноеСоциальноеМедицинскоеСтрахование</name>
      <description>Взносы на обязательное социальное медицинское страхование</description>
    </items>
    <items>
      <name>ИндивидуальныйПодоходныйНалог</name>
      <description>Индивидуальный подоходный налог</description>
    </items>
    <items>
      <name>ИндивидуальныйПодоходныйНалогИностранныеГраждане</name>
      <description>Индивидуальный подоходный налог за иностранных граждан</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимость</name>
      <description>Налог на добавленную стоимость</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимостьСИзмененнымСрокомУплаты</name>
      <description>Налог на добавленную стоимость с измененным сроком уплаты</description>
    </items>
    <items>
      <name>НалогНаИмущество</name>
      <description>Налог на имущество</description>
    </items>
    <items>
      <name>НалогНаПрибыль</name>
      <description>Налог на прибыль (корпоративный подоходный налог)</description>
    </items>
    <items>
      <name>НалогНаТранспорт</name>
      <description>Налог на транспорт</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимостьЗаНерезидента</name>
      <description>НДС за нерезидента</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимостьИмпортРБ</name>
      <description>НДС на товары таможенного союза, ввозимые с территории РБ</description>
    </items>
    <items>
      <name>НалогНаДобавленнуюСтоимостьИмпортРФ</name>
      <description>НДС на товары таможенного союза, ввозимые с территории РФ</description>
    </items>
    <items>
      <name>ОбязательныеПенсионныеВзносы</name>
      <description>Обязательные пенсионные взносы</description>
    </items>
    <items>
      <name>ОбязательныеПрофессиональныеПенсионныеВзносы</name>
      <description>Обязательные профессиональные пенсионные взносы</description>
    </items>
    <items>
      <name>ОбязательныеСоциальныеОтчисления</name>
      <description>Обязательные социальные отчисления</description>
    </items>
    <items>
      <name>ОтчисленияОбязательноеСоциальноеМедицинскоеСтрахование</name>
      <description>Отчисления на обязательное социальное медицинское страхование</description>
    </items>
    <items>
      <name>СоциальныйНалог</name>
      <description>Социальный налог</description>
    </items>
    <items>
      <name>СоциальныйНалогИнвалиды</name>
      <description>Социальный налог за инвалидов</description>
    </items>
    <items>
      <name>СоциальныйНалогИностранныеСпециалисты</name>
      <description>Социальный налог за иностранных специалистов</description>
    </items>
  </predefined>
  <attributes>
    <name>КодБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодНазначенияПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСКонтрагентомБУ</name>
    <type>
      <types>ChartOfAccountsRef.Типовой</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасчетовСКонтрагентомНУ</name>
    <type>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтноситьНаВычетыВПределахУплаченнойСуммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Base_1/src/Catalogs/ВычетыИПН/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	ЗаполнитьЭлемент("ВычетОПВ"												, 1, "ПоИсчисленнойСуммеВзносов", "ОбязательныеПенсионныеВзносы", 0 , "ВПределахМесяца"			 , Ложь);
	ЗаполнитьЭлемент("ВычетВОСМС"											, 2, "ПоИсчисленнойСуммеВзносов", "ВзносыОбязательноеСоциальноеМедицинскоеСтрахование", 0 , "ВПределахМесяца", Ложь);
	ЗаполнитьЭлемент("Стандартный1МЗП"										, 3, "Стандартный"				, ""							, 1 , "ВПределахМесяца"			 , Ложь);
	ЗаполнитьЭлемент("Стандартный75МЗПИнвалиды"								, 4, "Стандартный"				, ""							, 75, "ВПределахКалендарногоГода", Ложь);
	ЗаполнитьЭлемент("Стандартный75МЗПРодители"								, 5, "Стандартный"				, ""							, 75, "ВПределахКалендарногоГода", Ложь);
	ЗаполнитьЭлемент("ДобровольныеПенсионныеВзносы"							, 6, "ПоПериодическимПлатежам"	, ""							, 0 , "ВПределахМесяца"			 , Ложь);
	ЗаполнитьЭлемент("НаОплатуМедицинскихУслуг"								, 7, "ПоПериодическимПлатежам"	, ""							, 8 , "ВПределахКалендарногоГода", Ложь);
	ЗаполнитьЭлемент("ПогашениеВознагражденияПоЖилищнымЗаймам"				, 8, "ПоПериодическимПлатежам"	, ""							, 0 , "ВПределахМесяца"			 , Ложь);
	ЗаполнитьЭлемент("СтраховыеПремииПоДоговорамНакопительногоСтрахования"	, 9, ""							, ""							, 0	, ""						 , Истина);
	
КонецПроцедуры	

Процедура ЗаполнитьЭлемент(ИмяЭлемента, Приоритет, ПредоставлениеВычета, ВидВзносов, ПределВычета, ПериодПредоставления, НеИспользуется)
	
	СправочникОъект 			= Справочники.ВычетыИПН[ИмяЭлемента].ПолучитьОбъект();
	СправочникОъект.Приоритет	= Приоритет;
	Если НеИспользуется Тогда
		СправочникОъект.НеИспользуется	= Истина;
	Иначе
		СправочникОъект.ПредоставлениеВычета = Перечисления.ВидыПредоставленияВычетов[ПредоставлениеВычета];
		Если  ВидВзносов <> "" Тогда
			СправочникОъект.ВидВзносов 		 = Справочники.НалогиСборыОтчисления[ВидВзносов];
		КонецЕсли;	
		СправочникОъект.ПределВычета		 = ПределВычета;
		СправочникОъект.ПериодПредоставления = Перечисления.ПериодыРасчетаВычетовИКорректировокДоходов[ПериодПредоставления];
	КонецЕсли;
	
	СправочникОъект.ОбменДанными.Загрузка= Истина;
	
	Попытка
		СправочникОъект.Записать();
	Исключение
		ТекстСообщения = НСтр("ru='Операция не выполнена'");
		ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры	

Функция МаксимальныйПриоритет() Экспорт 
	Запрос		 = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	МАКСИМУМ(ВычетыИПН.Приоритет) КАК Приоритет
	|ИЗ
	|	Справочник.ВычетыИПН КАК ВычетыИПН";
	
	
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаЗапроса.Следующий() Тогда
		Возврат ВыборкаЗапроса.Приоритет;
	Иначе
		Возврат 0;
	КонецЕсли;	
КонецФункции

Процедура ОбновитьСправочникВычетыИПНИПН2019() Экспорт 
	
	Стандартный75МЗПИнвалидыОбъект = Справочники.ВычетыИПН.Стандартный75МЗПИнвалиды.ПолучитьОбъект();
	Стандартный75МЗПИнвалидыобъект.Наименование = НСтр("ru = 'Стандартный вычет (инвалидам, участникам ВОВ)'");
	Стандартный75МЗПИнвалидыобъект.ОбменДанными.Загрузка = Истина;
	Стандартный75МЗПИнвалидыобъект.Записать();
	
	Стандартный75МЗПРодителиОбъект = Справочники.ВычетыИПН.Стандартный75МЗПРодители.ПолучитьОбъект();
	Стандартный75МЗПРодителиОбъект.Наименование = НСтр("ru = 'Стандартный вычет (родителям инвалидов, приемным родителям)'");
	Стандартный75МЗПРодителиОбъект.ОбменДанными.Загрузка = Истина;
	Стандартный75МЗПРодителиОбъект.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьВычетВОСМС() Экспорт
	
	Если НЕ ПланыОбмена.ГлавныйУзел() = Неопределено Тогда // В подчиненных узлах РИБ не выполняется
		Возврат;	
	КонецЕсли;
	
	Справочники.ВычетыИПН.ЗаполнитьПредопределенныеЭлементы();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыВычетовИПН.Ссылка КАК Ссылка,
		|	ВидыВычетовИПН.Приоритет КАК Приоритет
		|ИЗ
		|	Справочник.ВычетыИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	НЕ ВидыВычетовИПН.Предопределенный
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыВычетовИПН.Приоритет УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВычетИПН = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ВычетИПН.Приоритет = ВыборкаДетальныеЗаписи.Приоритет + 1;
		ВычетИПН.ОбменДанными.Загрузка = Истина;
		Попытка
			ВычетИПН.Записать();
		Исключение
			ТекстСообщения = НСтр("ru='Операция не выполнена'");
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
